In [1]:
import sqlite3
import pandas as pd

In [2]:
db = sqlite3.connect('hubway.db')

In [3]:
def run_query(query):
    return pd.read_sql_query(query,db)

In [26]:
query = 'select * FROM sqlite_master;'
run_query(query)

,type,name,tbl_name,rootpage,sql
0,table,trips,trips,2,"CREATE TABLE trips (id INTEGER, duration INTEG..."
1,table,stations,stations,33340,"CREATE TABLE stations (id INTEGER, station TEX..."

In [28]:
query = 'select count(*) as \'Number of tables\' FROM sqlite_master;'
run_query(query)

   Number of tables
0                 2

In [29]:
query = 'select * from trips limit 5;'
run_query(query)

,id,duration,start_date,start_station,end_date,end_station,bike_number,sub_type,zip_code,birth_date,gender
0,1,9,2011-07-28 10:12:00,23,2011-07-28 10:12:00,23,B00468,Registered,'97217,1976.0,Male
1,2,220,2011-07-28 10:21:00,23,2011-07-28 10:25:00,23,B00554,Registered,'02215,1966.0,Male
2,3,56,2011-07-28 10:33:00,23,2011-07-28 10:34:00,23,B00456,Registered,'02108,1943.0,Male
3,4,64,2011-07-28 10:35:00,23,2011-07-28 10:36:00,23,B00554,Registered,'02116,1981.0,Female
4,5,12,2011-07-28 10:37:00,23,2011-07-28 10:37:00,23,B00554,Registered,'97214,1983.0,Female

In [35]:
query = 'select count(*) as \'number of rows in trips\' from trips;'
run_query(query)

   number of rows in trips
0                  1570001

In [37]:
query = 'select * from stations limit 5;'
run_query(query)

,id,station,municipality,lat,lng
0,3,Colleges of the Fenway,Boston,42.340021,-71.100812
1,4,Tremont St. at Berkeley St.,Boston,42.345392,-71.069616
2,5,Northeastern U / North Parking Lot,Boston,42.341814,-71.090179
3,6,Cambridge St. at Joy St.,Boston,42.361284999999995,-71.06514
4,7,Fan Pier,Boston,42.353412,-71.044624

In [38]:
query = 'select count(*) as \'number of rows in stations\' from stations;'
run_query(query)

   number of rows in stations
0                         142

In [42]:
query = '''
select duration 
from trips 
order by duration desc 
limit 1;
'''
run_query(query)

   duration
0      9999

In [46]:
query = '''
select sub_type, count(*) as 'number of trips'
from trips 
group by sub_type
'''
run_query(query)

     sub_type  number of trips
0      Casual           464809
1  Registered          1105192

In [47]:
query = '''
select count(*) as 'number of trips by registered users'
from trips 
where sub_type = 'Registered'
'''
run_query(query)

   number of trips by registered users
0                              1105192

In [51]:
query = '''
select avg(duration) as 'Average duration'
from trips 
'''
run_query(query)

   Average duration
0        912.409682

In [52]:
query = '''
select sub_type, avg(duration) as 'Average duration'
from trips 
group by sub_type
'''
run_query(query)

     sub_type  Average duration
0      Casual       1519.643897
1  Registered        657.026067

In [74]:
query = '''
select bike_number as 'Bike', count (*) as 'number of trips by bike'
from trips
group by bike_number
order by count(*) desc
limit 1
'''
run_query(query)

     Bike  number of trips by bike
0  B00490                     2120

In [63]:
query = '''
select round(avg(duration)) as 'average duration of trips by users over the age of 30'
from trips
where (2017-birth_date)>30
'''
run_query(query)

   average duration of trips by users over the age of 30
0                                              923.0

In [64]:
query = 'select * from trips limit 5;'
run_query(query)

,id,duration,start_date,start_station,end_date,end_station,bike_number,sub_type,zip_code,birth_date,gender
0,1,9,2011-07-28 10:12:00,23,2011-07-28 10:12:00,23,B00468,Registered,'97217,1976.0,Male
1,2,220,2011-07-28 10:21:00,23,2011-07-28 10:25:00,23,B00554,Registered,'02215,1966.0,Male
2,3,56,2011-07-28 10:33:00,23,2011-07-28 10:34:00,23,B00456,Registered,'02108,1943.0,Male
3,4,64,2011-07-28 10:35:00,23,2011-07-28 10:36:00,23,B00554,Registered,'02116,1981.0,Female
4,5,12,2011-07-28 10:37:00,23,2011-07-28 10:37:00,23,B00554,Registered,'97214,1983.0,Female

In [65]:
query = 'select * from stations limit 5;'
run_query(query)

,id,station,municipality,lat,lng
0,3,Colleges of the Fenway,Boston,42.340021,-71.100812
1,4,Tremont St. at Berkeley St.,Boston,42.345392,-71.069616
2,5,Northeastern U / North Parking Lot,Boston,42.341814,-71.090179
3,6,Cambridge St. at Joy St.,Boston,42.361284999999995,-71.06514
4,7,Fan Pier,Boston,42.353412,-71.044624

In [86]:
query = '''
select stations.station, count (*) as 'Number of times as start station'
from trips
inner join stations
on trips.start_station = stations.id
group by station
order by count (*) desc
limit 1
'''
run_query(query)

                             station  Number of times as start station
0  South Station - 700 Atlantic Ave.                             56123

In [92]:
query = '''
select stations.station, count (*) as 'Number of times as round trips'
from trips
inner join stations
on trips.start_station = stations.id
where start_station = end_station
group by station
order by count (*) desc
limit 1
'''
run_query(query)

                                       station  Number of times as round trips
0  The Esplanade - Beacon St. at Arlington St.                            3064

In [95]:
query = '''
select count (*) as 'Count'
from trips
inner join stations as start
on trips.start_station = start.id
inner join stations as end
on trips.end_station = end.id
where start.municipality <> end.municipality
'''
run_query(query)

    Count
0  309748

In [96]:
query = '''
select count (*) as 'Count'
from trips
where duration > 30
'''
run_query(query)

     Count
0  1562949

In [75]:
query = '''
select bike_number
from trips
order by duration desc
limit 1
'''
run_query(query)

  bike_number
0      T01078

In [99]:
query = '''
select sub_type, count (*) as 'number of round trips'
from trips
inner join stations
on trips.start_station = stations.id
where start_station = end_station
group by sub_type
'''
run_query(query)

     sub_type  number of round trips
0      Casual                  41427
1  Registered                  31635